/**
* \file  edma.c
*
*
*/
/* Driver APIs */
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <am335x_clock.h>

#include "am335x_edma3.h"
#include "am335x_edma3_hw.h"
#include "am335x_edma3_cc.h"
#include "am335x_edma3_tc.h"

/****************************************************************************/
/*                         GLOBAL VARIABLES                                 */
/****************************************************************************/
#define REGION_ID 0

typedef struct am335x_edma_shadow_region {
	uint32_t er;		//0
	uint32_t erh;		//4
	uint32_t ecr;		//8
	uint32_t ecrh;		//c
	uint32_t esr;		//10
	uint32_t esrh;		//14
	uint32_t cer;		//18
	uint32_t cerh;		//1c
	uint32_t eer;		//20
	uint32_t eerh;		//24
	uint32_t eecr;		//28
	uint32_t eecrh;		//2c
	uint32_t eesr;		//30
	uint32_t eesrh;		//34
	uint32_t ser;		//38
	uint32_t serh;		//3c
	uint32_t secr;		//40
	uint32_t secrh;		//44
	uint32_t _res0[2];	//48 - 4c (reserved)
	uint32_t ier;		//50
	uint32_t ierh;		//54
	uint32_t iecr;		//58
	uint32_t iecrh;		//5c
	uint32_t iesr;		//60
	uint32_t iesrh;		//64
	uint32_t ipr;		//68
	uint32_t iprh;		//6c
	uint32_t icr;		//70
	uint32_t icrh;		//74
	uint32_t _res1[2];	//78 - 7c
	uint32_t qer;		//80
	uint32_t qeer;		//84
	uint32_t qeecr;		//88
	uint32_t qeesr;		//8c
	uint32_t qser;		//90
	uint32_t qsecr;		//94
	uint32_t _res2[90];	//98 - 1fc (reserved)
}am33x_edma_shadow_region_t;

struct am335x_edma_ctrl{
	uint32_t pid; 			//0
	uint32_t cccfg;			//4
	uint32_t _res0[2];		//8 - c 		(reserved)
	uint32_t sysconfig;		//10
	uint32_t _res1[59];		//14 - fc 		(reserved)
	uint32_t dchmap[64];	//100 - 1fc
	uint32_t qchmap[8];		//200 - 21c
	uint32_t _res2[8];		//220 - 23c		(reserved)
	uint32_t dmaqnum[8];	//240 - 25c
	uint32_t qdmaqnum;		//260
	uint32_t _res3[8];		//264 - 280		(reserved)
	uint32_t quepri;		//284
	uint32_t _res4[30];		//288 - 2fc		(reserved)
	uint32_t emr;			//300
	uint32_t emrh;			//304
	uint32_t emcr;			//308
	uint32_t emcrh;			//30c
	uint32_t qemr;			//310
	uint32_t qemcr;			//314
	uint32_t ccerr;			//318
	uint32_t ccerrclr;		//31c
	uint32_t eeval;			//320
	uint32_t _res5[7];		//324 - 33c		(reserved)
	uint32_t drae0;			//340
	uint32_t draeh0;		//344
	uint32_t drae1;			//348
	uint32_t draeh1;		//34c
	uint32_t drae2;			//350
	uint32_t draeh2;		//354
	uint32_t drae3;			//358
	uint32_t draeh3;		//35c
	uint32_t drae4;			//360
	uint32_t draeh4;		//364
	uint32_t drae5;			//368
	uint32_t draeh5;		//36c
	uint32_t drae6;			//370
	uint32_t draeh6;		//374
	uint32_t drae7;			//378
	uint32_t draeh7;		//37c
	uint32_t qrae[8];		//380 - 398
	uint32_t _res19[24];	//39c - 3fc
	uint32_t q0e[16];		//400 - 43c
	uint32_t q1e[16];		//440 - 47c
	uint32_t q2e[16];		//480 - 4bc
	uint32_t _res6[80];		//4c0 - 600		(reserved)
	uint32_t qstat[3];		//600 - 608
	uint32_t _res7[5];		//60c - 61c		(reserved)
	uint32_t qwmthra; 		//620
	uint32_t _res8[7];		//624 - 63c
	uint32_t ccstat;		//640
	uint32_t _res9[111];	//644 - 7fc		(reserved)
	uint32_t mpfar;			//800
	uint32_t mpfsr;			//804
	uint32_t mpfcr;			//808
	uint32_t mppag;			//80c
	uint32_t mppa[8];		//810 - 82c
	uint32_t _res10[500];	//830 - ffc		(reserved)
	uint32_t er;			//1000
	uint32_t erh;			//1004
	uint32_t _res11[2];		//1008 - 100c	(reserved)
	uint32_t esr;			//1010
	uint32_t esr_h;			//1014
	uint32_t cer;			//1018
	uint32_t cerh;			//101c
	uint32_t eer;			//1020
	uint32_t eerh;			//1024
	uint32_t eecr;			//1028
	uint32_t eecrh;			//102c
	uint32_t eesr;			//1030
	uint32_t eesrh;			//1034
	uint32_t ser;			//1038
	uint32_t serh;			//103c
	uint32_t _res12[4];		//1040 - 104c	(reserved)
	uint32_t ier;			//1050
	uint32_t ierh;			//1054
	uint32_t iecr;			//1058
	uint32_t iecrh;			//105c
	uint32_t iesr;			//1060
	uint32_t iesrh;			//1064
	uint32_t ipr;			//1068
	uint32_t iprh;			//106c
	uint32_t icr;			//1070
	uint32_t icrh;			//1074
	uint32_t ieval;			//1078
	uint32_t _res13;		//107c	-------	(reserved)
	uint32_t qer;			//1080
	uint32_t qeer;			//1084
	uint32_t qeecr;			//1088
	uint32_t qeesr;			//108c
	uint32_t qser;			//1090
	uint32_t qsecr;			//1094
	uint32_t _res14[986];	//1098 - 1ffc	(reserved)
	am33x_edma_shadow_region_t shadow_r[8];//2000 - 2ffc
	uint32_t _res18[1024];					//3000 - 3ffc  (reserved)
	struct edma3cc_param_entry PaRAM[256];		//4000 - 5ffc
};


// pointers for MMC register's base addresses
static volatile struct am335x_edma_ctrl* edma_ctrl[] = {
		(struct am335x_edma_ctrl*)(0x49000000),	// EDMA3CC
		(struct am335x_edma_ctrl*)(0x49800000),	// EDMA3TC0
		(struct am335x_edma_ctrl*)(0x49900000),	// EDMA3TC1
		(struct am335x_edma_ctrl*)(0x49a00000),	// EDMA3TC2
};

// EDMA callback function array
static void (*cb_routine[EDMA3_NUM_TCC]) (void* param);
static void* cb_param[EDMA3_NUM_TCC];

/****************************************************************************/
/*                     API FUNCTION DEFINITIONS                             */
/****************************************************************************/

/*
** This function is used as a callback from EDMA3 Completion Handler.
*/
static void am335x_edma_callback(uint32_t tccNum, uint32_t status)
{
	(void)status;
	am335x_edma_disable_transfer(AM335X_EDMA3CC, tccNum, EDMA3_TRIG_MODE_EVENT);
