/*
 * MMC_driver.c
 *
 *  Created on: Jun 2, 2016
 *      Author: Romain Plouzin
 *
 *      abstract : driver for MMC peripheral
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>

#include "am335x_mmc.h"
#include "am335x_clock.h"
#include "am335x_mux.h"
#include "am335x_edma3.h"

/*
 * this structure describes the organization of MMC registers in memory
 */
struct mmc_ctrl {
	uint8_t  res0[0x110];
	uint32_t sysconfig;	//110
	uint32_t sysstatus;	//114
	uint32_t res1[3];	//118-120
	uint32_t csre;		//124
	uint32_t systest;	//128
	uint32_t con;		//12c
	uint32_t pwcnt;		//130
	uint32_t res2[51];	//134-1fC
	uint32_t sdmasa;	//200
	uint32_t blk;		//204
	uint32_t arg;		//208
	uint32_t cmd;		//20c
	uint32_t rsp[4];	//210-21c
	uint32_t data;		//220
	uint32_t pstate;	//224
	uint32_t hctl;		//228
	uint32_t sysctl;	//22c
	uint32_t stat;		//230
	uint32_t ie;		//234
	uint32_t ise;		//238
	uint32_t ac12;		//23c
	uint32_t capa;		//240
	uint32_t res3[1];	//244
	uint32_t cur_capa;	//248
	uint32_t res4[1];	//24c
	uint32_t fe;		//250
	uint32_t admaes;	//254
	uint32_t admasal;	//258
	uint32_t admasah;	//25c
	uint32_t res5[39];	//260-2f8
	uint32_t rev;		//2fc
};
// pointers for MMC register's base addresses
static struct mmc_ctrl* mmc_ctrl[] = {
	(struct mmc_ctrl*)(0x48060000),	// MMC0
	(struct mmc_ctrl*)(0x481d8000),	// MMC1
//	(struct mmc_ctrl*)(0x47810000),	// MMC2
};

// ----------------------------------------------------------------------------
// constants for MMC/SD registers
// ----------------------------------------------------------------------------
// MMC_SYSCONFIG register
#define SYCONFIG_STANDBYMODE_MASK 	(0x3<<12)

#define SYSCONFIG_CLKACTIVITY_NONE	(0x00<<8)
#define SYSCONFIG_CLKACTIVITY_INTER	(0x01<<8)
#define SYSCONFIG_CLKACTIVITY_FUNC	(0x02<<8)
#define SYSCONFIG_CLKACTIVITY_BOTH	(0x03<<8)


#define SYSCONFIG_SIDLEMODE_FORCE	(0x00<<3)
#define SYSCONFIG_SIDLEMODE_NONE	(0x01<<3)
#define SYSCONFIG_SIDLEMODE_SMART	(0x02<<3)
#define SYSCONFIG_SIDLEMODE_MASK	(0x03<<3)

#define SYSCONFIG_ENAWAKEUP		(0x1<<2)

